---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalCurvedPanelNotValid
source: html/ebf27828-6ee9-7f4c-0a94-99b45268520c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalCurvedPanelNotValid Property

Analytical Curved Panel is not valid.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalCurvedPanelNotValid { get; }
```